In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,np.nan, np.nan,5,7])

In [3]:
s

0    1.0
1    3.0
2    NaN
3    NaN
4    5.0
5    7.0
dtype: float64

In [4]:
dates = pd.date_range('20130101',periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01 -0.905746 -0.389257 -0.922436 -1.464708
2013-01-02 -1.680683 -0.521692  0.475632  0.445441
2013-01-03 -0.447679  0.789941 -0.878951 -1.292479
2013-01-04  1.102025  0.386855 -0.306543 -1.097289
2013-01-05 -0.279843 -1.382036 -2.689050  0.684542
2013-01-06 -1.393328  1.117048  1.066429  0.740946

In [8]:
df2 = pd.DataFrame({ 'A' : 1,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : 'foo' })

In [9]:
df2

   A          B    C  D    E
0  1 2013-01-02  1.0  3  foo
1  1 2013-01-02  1.0  3  foo
2  1 2013-01-02  1.0  3  foo
3  1 2013-01-02  1.0  3  foo

In [10]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E            object
dtype: object

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.head()

                   A         B         C         D
2013-01-01 -0.905746 -0.389257 -0.922436 -1.464708
2013-01-02 -1.680683 -0.521692  0.475632  0.445441
2013-01-03 -0.447679  0.789941 -0.878951 -1.292479
2013-01-04  1.102025  0.386855 -0.306543 -1.097289
2013-01-05 -0.279843 -1.382036 -2.689050  0.684542

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.102025  0.386855 -0.306543 -1.097289
2013-01-05 -0.279843 -1.382036 -2.689050  0.684542
2013-01-06 -1.393328  1.117048  1.066429  0.740946

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [16]:
df.values

array([[-0.90574562, -0.3892575 , -0.92243579, -1.46470795],
       [-1.68068289, -0.52169173,  0.4756317 ,  0.44544121],
       [-0.44767921,  0.78994077, -0.87895075, -1.29247918],
       [ 1.1020249 ,  0.38685492, -0.3065431 , -1.09728923],
       [-0.27984266, -1.38203639, -2.68904996,  0.68454241],
       [-1.39332818,  1.11704773,  1.06642883,  0.74094567]])

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.600876  0.000143 -0.542487 -0.330591
std    0.991293  0.933292  1.307375  1.056427
min   -1.680683 -1.382036 -2.689050 -1.464708
25%   -1.271433 -0.488583 -0.911565 -1.243682
50%   -0.676712 -0.001201 -0.592747 -0.325924
75%   -0.321802  0.689169  0.280088  0.624767
max    1.102025  1.117048  1.066429  0.740946

In [18]:
df.mean()

A   -0.600876
B    0.000143
C   -0.542487
D   -0.330591
dtype: float64

In [19]:
df.count()

A    6
B    6
C    6
D    6
dtype: int64

#### Transpose data

In [20]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.905746   -1.680683   -0.447679    1.102025   -0.279843   -1.393328
B   -0.389257   -0.521692    0.789941    0.386855   -1.382036    1.117048
C   -0.922436    0.475632   -0.878951   -0.306543   -2.689050    1.066429
D   -1.464708    0.445441   -1.292479   -1.097289    0.684542    0.740946

In [21]:
df.sort_index()

                   A         B         C         D
2013-01-01 -0.905746 -0.389257 -0.922436 -1.464708
2013-01-02 -1.680683 -0.521692  0.475632  0.445441
2013-01-03 -0.447679  0.789941 -0.878951 -1.292479
2013-01-04  1.102025  0.386855 -0.306543 -1.097289
2013-01-05 -0.279843 -1.382036 -2.689050  0.684542
2013-01-06 -1.393328  1.117048  1.066429  0.740946

In [24]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.464708 -0.922436 -0.389257 -0.905746
2013-01-02  0.445441  0.475632 -0.521692 -1.680683
2013-01-03 -1.292479 -0.878951  0.789941 -0.447679
2013-01-04 -1.097289 -0.306543  0.386855  1.102025
2013-01-05  0.684542 -2.689050 -1.382036 -0.279843
2013-01-06  0.740946  1.066429  1.117048 -1.393328

In [31]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05 -0.279843 -1.382036 -2.689050  0.684542
2013-01-02 -1.680683 -0.521692  0.475632  0.445441
2013-01-01 -0.905746 -0.389257 -0.922436 -1.464708
2013-01-04  1.102025  0.386855 -0.306543 -1.097289
2013-01-03 -0.447679  0.789941 -0.878951 -1.292479
2013-01-06 -1.393328  1.117048  1.066429  0.740946

In [33]:
df['A']

2013-01-01   -0.905746
2013-01-02   -1.680683
2013-01-03   -0.447679
2013-01-04    1.102025
2013-01-05   -0.279843
2013-01-06   -1.393328
Freq: D, Name: A, dtype: float64

In [34]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.905746 -0.389257 -0.922436 -1.464708
2013-01-02 -1.680683 -0.521692  0.475632  0.445441
2013-01-03 -0.447679  0.789941 -0.878951 -1.292479

In [35]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.680683 -0.521692  0.475632  0.445441
2013-01-03 -0.447679  0.789941 -0.878951 -1.292479
2013-01-04  1.102025  0.386855 -0.306543 -1.097289

#### Selection by Label

In [36]:
df.loc[dates[0]]

A   -0.905746
B   -0.389257
C   -0.922436
D   -1.464708
Name: 2013-01-01 00:00:00, dtype: float64

In [37]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.905746 -0.389257
2013-01-02 -1.680683 -0.521692
2013-01-03 -0.447679  0.789941
2013-01-04  1.102025  0.386855
2013-01-05 -0.279843 -1.382036
2013-01-06 -1.393328  1.117048

In [38]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.680683 -0.521692
2013-01-03 -0.447679  0.789941
2013-01-04  1.102025  0.386855